"""2. А және В екі бүтін сандар берілген. А<B болса, өсу ретімен немесе басқаша жағдайда кему ретімен А-дан В-ға дейінгі барлық сандарды басып шығарыңыз.
Даны два целых числа A и В. Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае."""

import random

num_1 = random.randrange(10)
num_2 = random.randrange(10)
if num_1 < num_2:
    while num_1 <= num_2:
        print(str(num_1))
        num_1 += 1
elif num_2 < num_1:
    while num_1 >= num_2:
        print(str(num_1))
        num_1 -= 1
